window.members = ["凌晓辉", "黄健平", "郑泽帆", "刘芳", "郭彩红", "梁依茜", "谢婉婷", "李钊", "廖好", "孔海莹", "任嘉文", "梁莉", "李雪霞", "徐玉兰", "胡甜", "徐若琳", "陈琼芬", "文君妍", "向丽", "周俊健", "张慧林", "徐秀芳", "钱德军", "杨峰", "徐秀红", "邢越嘉", "李琦", "苗丽莉", "朱春贵", "梁凤仪", "罗海媚", "侯志平", "周泳恩", "邱沐泽", "王靖南", "梁文辉", "吕娟", "陈天伦", "梁智睿", "黄勇发", "孙新飞", "张正攀", "陈嘉展", "宋丽珊", "温瑞伟", "邵俊杰", "杨昊照", "袁锦超", "伍江", "王逸枫", "张文龙", "魏俊杰", "郑伟生", "陈文锋", "严子雄", "何力", "付俊杰", "曾煌", "倪素玲", "刘鑫", "陈应展", "谭奎", "朱剑客", "伍伟鸿", "龙世林", "吴超伟", "李俊", "郑秋芸", "郑意洁", "潘思琪", "江燕娜", "陈红图", "方主丰", "何婉君", "邱建忠", "王伯熙", "梁伟健", "廖家宝", "梁炳威", "刘树明", "胡韵淇", "李明丽", "黄细娜", "邝韶雅", "吴锦华", "原芷欣", "吴子俊", "唐远琪", "蔡佳婉", "陈慧然", "陈瑞妍", "金光", "郑宇龙", "邓翠盛", "凌正阳", "王文泽", "王继乾", "王梦丹", "陈尝宇", "彭丹", "蔡雅婷", "刘栋栋", "马元丰", "欧俊辉", "谭荣省", "贾海旭", "蔡晓婷"]

// 随机排序
function mapRandom(arr) {
	arr.sort(function() {
		return Math.random() - 0.5
	})
	return arr
}

window.members = mapRandom(window.members)

window.members = window.members.map((i,j) => {
	return {
		id: j + 1,
		name: i
	}
})

localStorage.setItem('members', JSON.stringify(window.members))